PS C:\Users\Manasa\Desktop\c-activity-set1\set01> gcc -g -O0 problem02.c -o problem02.exe
PS C:\Users\Manasa\Desktop\c-activity-set1\set01> gdb .\problem02.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\Users\Manasa\Desktop\c-activity-set1\set01\problem02.exe...done.
(gdb) b main
Breakpoint 1 at 0x40146e: file problem02.c, line 6.
(gdb) r
Starting program: C:\Users\Manasa\Desktop\c-activity-set1\set01/.\problem02.exe 
[New Thread 2996.0x4c14]
[New Thread 2996.0x7f7c]

Breakpoint 1, main () at problem02.c:6
6           printf("enter the value for a\n");
(gdb) n
enter the value for a
7           scanf("%d",&a);
(gdb) 6
Undefined command: "6".  Try "help".
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
error return ../../gdb-7.6.1/gdb/windows-nat.c:1275 was 5
Starting program: C:\Users\Manasa\Desktop\c-activity-set1\set01/.\problem02.exe 
[New Thread 9968.0x247c]
[New Thread 9968.0x6d0c]

Breakpoint 1, main () at problem02.c:6
6           printf("enter the value for a\n");
(gdb) n
enter the value for a
7           scanf("%d",&a);
(gdb) n
7
8           printf("enter the value for b\n");
(gdb) n
enter the value for b
9           scanf("%d",&b);
(gdb) n
4
10          sum=a+b;
(gdb) n
11          printf("%d",sum);
(gdb) p sum
$1 = 11
(gdb) n
1112        return 0;
(gdb) c
Continuing.
[Inferior 1 (process 9968) exited normally]
(gdb) q