 gdb ./problem12.exe
GNU gdb (GDB) 7.6.1
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "mingw32".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from C:\Users\Manasa\Desktop\c-activity-set1\set01\problem12.exe...done.
(gdb) b main
Breakpoint 1 at 0x40164e: file problem12.c, line 66.
(gdb) r
Starting program: C:\Users\Manasa\Desktop\c-activity-set1\set01/./problem12.exe
[New Thread 5336.0x1cc8]
[New Thread 5336.0x4fe4]

Breakpoint 1, 0x0040164e in main () at problem12.c:66
66      {
(gdb) n
67          int n=get_n();
(gdb) s
get_n () at problem12.c:15
15          printf("Enter the number of complex numbers : ");
(gdb) s
Enter the number of complex numbers : 16            scanf("%d", &n);
(gdb) n 
4
17
(gdb) n
18
(gdb) n
main () at problem12.c:68
68
(gdb) n
69
(gdb) n
Enter Complex Number 1:
Enter the real part : 2
Enter the imaginary part : 3
Enter Complex Number 2:
Enter the real part : 4
Enter the imaginary part : 5
Enter Complex Number 3:
Enter the real part : 4
Enter the imaginary part : 5
Enter Complex Number 4:
Enter the real part : 4
Enter the imaginary part : 6
70
(gdb) n
71
(gdb) n
Complex Numbers:
Number 1 : 2.00 + 3.00i
Number 2 : 4.00 + 5.00i
Number 3 : 4.00 + 5.00i
Number 4 : 4.00 + 6.00i
Sum of the 4 complex numbers: 14.00 + 19.00i
72
(gdb) n
73
(gdb) n
0x00401288 in __register_frame_info ()
(gdb) c
Continuing.
[Inferior 1 (process 5336) exited normally]
(gdb) q
